[
{
    "Country": "Austria",
    "City": "Vienna",
    "Routes": {
       "Inbound": "From Germany | Most of the traffic going through Passau is heading East to Linz, Vienna, Budapest while most of the traffic going through Salzburg is heading South to Trieste, Italy, Slovenia, Balkans. | You should then seriously consider coming by the E56 (even if you come from southern Germany). | From East, West | If your driver heads to Slovakia (Bratislava), Hungary or the eastern Balkans they'll pass the Airport at Schwechat. There is public transportation, of course, but if you are in the departure area there are a lot of drivers emptying their cars before going back to the city. If you find yourself in a car that is passing through Vienna on the eastern ring road, try getting out around the Donau island (German: Donauinsel), close to the river. From here you can walk to a metro-station that usually heads directly towards the centre of Vienna. | You will often find yourself, especially at night, on the E60 passing south of Vienna. I dont know if trucks can go there since you have to go through an underpass: Jump out at the exit Campus 21/Breitenfurterstrasse GoogleMaps. Take care since it is an exit with 2 exits, you should keep as right as possible! About 100m further there is a roundabout where you can jump out and the car can get directly back to the highway. From that roundabout it is about 3km to the next U-Bahn, the final stop of U6. I found this to be the shortest way to get to public transport. If you come at night, there is a so called ASTAX, you call a number, and from the moment when there are enough people that want to go a small bus comes and picks you up, you pay by buying a regular ticket (Number, Schedule, ... in German). The ASTAX will bring you to the night bus N64 that is driving through basically all Vienna (map in German for public nightlines in Vienna).",
       "Outbound": {
           "From Vienna Airport" : "All directions Bratislava, Budapest, Brno, Linz or Graz. \n Vienna Airport is the largest one in the region and many people who are leaving or landing are being dropped or picked up there by their friends or family members. You can find rides in all of the directions by asking the drivers there according to their license plates. Departing travelers are often dropped at the Abflugstrasse above the ground floor of the terminals, arriving travelers are picked at the Kurzparkplatz in front of the arrival hall. Chance of getting such ride might be better at the Abflugstrasse as the driver going back has free place, but the with the arriving ones you will surely hear fresh travel stories.\n",
           "West towards Linz, Salzburg, Munich A 1 E 60" : {
               "Hadikgasse Busstop, recommended option" : " Take the U4 to Hütteldorf, get off and go towards Hadikgasse (left), walk left again, then you are right on the main road leading out of Vienna towards the A1. There is a bus stop which is a well known hitching spot. Change cars (if necessary) at the rest areas St. Pölten or Ansfelden. Since a direct ride to Salzburg is possible try to avoid 'part-rides' and avoid going to St. Polten at all cost- the traffic there is very low and mostly local. From here you can as well get to option 2 by crossing the motorway via the bridge and walk for about 2km to the right.",
               "OMV petrol station on Wiener Straße (A1)" : "Take train (S50) to Wien Wolf in der Au. Then cross over the bridge. You'll see the petrol station after about 300m to your left. Cross the bridge and then it's a short walk behind the barrier along the side of the road. There is as a big resting area with service station"
           },
           "North towards Prague" : "The easiest way to get from Vienna to Prague is to go through Brno.\n There is an option to go straight from Vienna to Prague. Take a train from Handelskai to Kornneuburg. Get out of the station and turn left. You'll get to a street called Doktor-Max-Burckhard-Ring, it will take you to the main street (Stockerauer Straße) Follow the main street, and then turn left on any of the first two streets (Scherzgasse or Hofaustraße) Turn right, and you'll get to the street that crosses the railways. Cross the railway and walk further until you see an on-ramp. There is also a petrol station to hitchhike from. However, most cars are only going to nearby towns from which it is not possible to hitchhike further. Again, try going through Brno instead.",
           "North towards Brno (Czech Republic) E 461" : {
               "Option 1" : "From central Wien take tram 31 to the last stop, Stammersdorf. Continue on your right down the main street, Brünner Str (road no. 7); go past the Merkur supermarket until you come to another shopping centre, about 300 m further. Hitchhike right after the entrance to the parking lot. You can use a sign 'Brno', but if you don't get a lift after 30 minutes, then just hitchhike without a sign and ask any driver to take you to Wolkersdorf or Mistelbach. There is a huge petrol station 5 km north of Wolkersdorf and from there it is easy to find a lift into the Czech Republic.",
               "Option 2" : "Take the free bus to G3 Shopping Center . The Bus starts from the regional buses' stop in front of the 'Floridsdorf Bahnhof' train station, they depart in 30 minute intervals, more frequently during Fridays/Saturdays, first bus at 08:00am. If you do make the terrible mistake of taking the local bus instead of the free one, it will cost you 4.20 euro and you can't black-ride, as it's paid to the driver. From where the bus stops, cross the parking lot towards the big street that the bus had taken out of Vienna and cross that street. There is a petrol station 'Eni' (the yellow one) and next to that there is a free, unused lane for cars and trucks to stop easily. GoogleMaps Footpath"
           },
           "East towards Bratislava, Győr and Budapest A 4 E 60" : "To get to this petrol station by public transport, take metro line U3 to Enkplatz and from there you can take a bus 76A to 7. Haidequerstraße (the bus stop is on the other side of the street at the intersection when you leave the metro station). Be careful because there are two stops with almost the same name, 7. Haidequerstraße and 11. Haidequerstraße – get off at the first one, which comes after the stop Simmeringer Haide. After the stop, the bus turns right, but to get to the petrol station, walk straight on on to the north for just 200 m. The petrol station is on the A4 highway towards Bratislava, Győr and Budapest. Once you have reached the petrol station, just wait near the entrance and ask drivers entering the shop.\nNote: Watch out for Romanian drivers who may attempt to charge you for the ride; make sure before you accept a lift from a Romanian driver that you are not going to pay by saying e.g. 'E gratis? / N-am bani sa va dau. ‘'Is the lift free? / I can't pay.’ \nMost of the cars passing in this petrol station are coming off the motorway or going to the airport. You can get more cars going to Slovakia or Hungary if you take the first ride to the next petrol station on the motorway, named Göttlesbrunn, which is just before road splits into the E58 towards Bratislava and the E60 towards Budapest. The E60 road enters Hungary at the Hegyeshalom-Nickelsdorf border crossing.\nIf your ultimate destination is Romania, then ask your driver to leave you at the Hegyeshalom-Nickelsdorf border crossing and hitch from there with a sign Romania",
           "South towards Graz, Slovenia, Zagreb A 2" : {
               "Triesterstraße, highly recommended" : "With the completion of the construction site the hitchspot at the onramp from Triesterstraße is open again.\nThere is a lot of space to stop. On empty streets cars will go 70km/h but they are slower (<50km/h) when there is more traffic (during most of the day). There is also street light and a bridge in case of night or rain. There is even a small section of gras with trees where you can camp. Public transport: Badner Bahn from Wien Meidling, station Wien Inzersdorf, ~5 min walk. A regular Vienna City Ticket (2,40€ in 2020) is sufficient.\nThere are several places beforehand on Triesterstraße where people tried hitchhiking. Triesterstraße / Computerstraße, public transport: Bus 16a from U6 Am Schöpfwerk. Triesterstraße / Herta-Firnberg-Straße, you can only ask people - no thumbing, includes a McDonalds and a gas station, public transport: Bus 7B from train station Wien Meidling",
               "IKEA" : "Take the free IKEA bus from U6 Siebenhirten to the SCS ('Shopping City Süd') 8:00/10:00/11:30/13:00/14:30/16:00/17:30. If it happens that you don't get a ride and want to use the same bus to come back to town it won't be free any more, it costs 1.50 euro.\nOther option if you want to pay EUR 3.40 for the train then take the Badener Bahn to Maria-Enzersdorf (Südstadt) Advantages of the latter one: it goes more often and earlier in the morning than the bus. If you take the train, you can go to one station after Shopping City Süd which is called Maria-Enzersdorf (Südstadt). This one is closer to the actual interchange: just get off the train, head the direction you came from, turn right by the end of the platform, cross the tracks, pass 100 m of wild grass and there is a curved street – you'll see the signs.\nAlternatively you can take public transport to Matzleinsdorfer Platz where the Triester Straße begins [1] (direction South-West). This road is extremely long but it has on-ramps for heading South (Graz). Try hitching along this road, or ask at the petrol station. If you keep walking down there is a perfect place for hitchhiking where cars take the exit and join the highway. There is a lot of grass and a perfect place with enough room for even a truck to stop.",
               "Grünbergstraße / Altmannsdorfer Straße": "If you are OK with hitchhiking at traffic lights, you can also just go to 'Schönbrunn' with U4 (underground – green line). Cross the street and walk towards the entrance of Schönbrunn-castle. Now you are on 'Grünbergstraße'. Here you can try to hitchhike from the traffic lights. This street leads to 'Altmannsdorfer Straße' which leads to A2 (the motorway leading to the south)\nFor everyone going to Slovenia or Zagreb, know that there are no petrol station on your side of the road some 100 kilometres before Graz. The first one is near Leibnitz, some 15-20 km after Graz. So if someone offers you a ride to Graz, try to see if they're maybe going to Leibnitz or past Leibnitz. There are many people from Maribor working in Graz, so if you end up in Graz, try using a sign for Maribor on roads going out of the city towards the highway. The petrol station near Leibnitz is on the way to Maribor. "
           }
       }
    }
 },
 {
    "Country": "Austria",
    "City": "Linz",
    "Routes": {
       "Inbound": "To be edited!",
       "Outbound": [{ 
           "East or South-West towards Vienna, Salzburg" : "One option is to go to the main train station of Linz and then walk from there to Waldeggstraße(2 minutes walk). Try to hitchhike from the bus station out of Linz onto the A7 leading out of the town, at least to the rest area Ansfelden. In order to lower the percentage of the local transport you can walk ca. 8 more minutes to the city-bus stop Kudlichstrasse. Here it is fairly easy for the drivers to stop and pick you up. This place should be fine for hitchhiking towards Prague as well.  Another option is to go by tram no. 1 or 2 to the stop 'Linke Brückenstraße'. There walk to your right (as you exit the tram) into the Freistädter Straße. Walk for a little while and then you are on the on-ramp onto the A7 which will take you out of Linz into any direction. You can also take bus no. 33 to 'Broschgasse', then you will be right next to this on-ramp. However, there is almost no space for the driver to stop on the side to pick you up therefore this place may be considered as a risky and not that well suited for hitchhiking. Otherwise, you can take the train from Linz Hbf to Ansfelden and walk from there to the rest area on the A1. If you want to go to Vienna but get a ride to the rest area Ansfelden, you have to change to the other side of the A1 to get eastwards, therefore use the pedestrian tunnel under the Autobahn which can be found just before the restaurant."
            },
            {
            "North towards Czech Republic Prague, Freistadt" : "Appart from the possibilities mentioned in the section above, another on-ramp to A7 is on the Hafenstrasse. There is a petrol station near the crossroad and traffic lights with a good place to stop, where almost all cars pass by from the city to the motorway. Try to get a ride to Freistadt cause there you will find a perfect hitchhiking road filled with Czech cars just a few kilometres from the boarder."
            }]
    }
 },
 {
    "Country": "Austria",
    "City": "Graz",
    "Routes": {
       "Inbound": "To be edited!",
       "Outbound": ""
    }
 }
]